Revit 2027 API
RebarHostData.GetPathReinforcementsInHost Method
 Returns all PathReinforcement elements hosted by the referenced element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<PathReinforcement> GetPathReinforcementsInHost()
Public Function GetPathReinforcementsInHost As IList(Of PathReinforcement)
public:
IList<PathReinforcement^>^ GetPathReinforcementsInHost()
member GetPathReinforcementsInHost : unit -> IList<PathReinforcement>
Return Value
IList<PathReinforcement>
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace